

Dear students, in this homework, you will analyze the Titanic dataset. Please read the tasks carefully and ask any questions you have on Discord. The homework consists of 10 tasks with a total of 10 points, but bonus points may be awarded for accuracy in task 10. Good luck and have fun!

In [1]:
import pandas as pd

##Task 1. Read the data and display top 5 rows(0.5 pt)

In [2]:
df = pd.read_csv("train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

##Task 2. Print dataframe's columns names and dimensionality(0.5 pt)

In [3]:
# bare minimum
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
# bare minimum
df.shape

(891, 12)

In [5]:
# or you can do it in more fancy way, though it's not needed
# from now on only the bare minimum will be shown
print('Columns:')
for c in df.columns: print(c)
print('')
print(f"The number of columns is {df.shape[1]}, the number of rows is {df.shape[0]}")

Columns:
PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

The number of columns is 12, the number of rows is 891

##Task 3. Calculate how many men and women are in the dataset (0.5 pt)

In [6]:
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

#Task 4. Calculate survival rate for men and women (0.5 pt)

In [7]:
survival_rate = df.groupby('Sex')['Survived'].mean()

print(survival_rate)

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

#Task 5. Group the data by Pclass and and display statistics on Age and Fare (1 pt)

In [8]:
df.groupby(['Pclass'])[['Age', 'Fare']].describe()

          Age                                                       Fare  \
        count       mean        std   min   25%   50%   75%   max  count
Pclass
1       186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0  216.0
2       173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0  184.0
3       355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0  491.0


             mean        std  min       25%      50%   75%       max
Pclass
1       84.154687  78.380373  0.0  30.92395  60.2875  93.5  512.3292
2       20.662183  13.417399  0.0  13.00000  14.2500  26.0   73.5000
3       13.675550  11.778142  0.0   7.75000   8.0500  15.5   69.5500

#Task 6. What is the most popular family name in the dataset (1 pt)

In [9]:
# Splitting the names to extract the last name (assuming last names are the first word in the 'Name' column)
last_names = df['Name'].apply(lambda x: x.split(',')[0])


# Display the most popular family name and its count
print(f"The most popular family name is '{last_names.value_counts().idxmax()}' with a count of {last_names.value_counts().max()}.")

The most popular family name is 'Andersson' with a count of 9.

##Task 7. What is the mean and std for all columns for survived male passengers (1 pt)

In [10]:
# Selecting rows where 'Survived' is 1 (survived) and 'Sex' is 'male'
survived_males = df[(df['Survived'] == 1) & (df['Sex'] == 'male')]

survived_males.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,109.000000,109.0,109.000000,93.000000,109.000000,109.000000,109.000000
mean,475.724771,1.0,2.018349,27.276022,0.385321,0.357798,40.821484
std,244.717482,0.0,0.922774,16.504803,0.636952,0.645826,71.355967
min,18.000000,1.0,1.000000,0.420000,0.000000,0.000000,0.000000
25%,272.000000,1.0,1.000000,18.000000,0.000000,0.000000,9.500000
50%,508.000000,1.0,2.000000,28.000000,0.000000,0.000000,26.287500
75%,680.000000,1.0,3.000000,36.000000,1.000000,1.000000,39.000000
max,890.000000,1.0,3.000000,80.000000,4.000000,2.000000,512.329200

#Task 8. Display rows from 40th to 60th (in numeration from zero) (1 pt)

In [11]:
# the key idea here is to use either df.loc[40:60] or df.iloc[40:61]
# here are two examples of smaller samples to make it easy to see the difference
df.loc[40:42]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,NaN,S
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C

In [12]:
df.iloc[40:42]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.475,NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.000,NaN,S

If your DataFrame has a default integer index (0, 1, 2, ...), df.loc[40:60] and df.iloc[40:60] would give you the same result. However, if your DataFrame has a custom index or if the index doesn't follow the default integer sequence, the results may differ.
You can check documentation for detailed information https://pandas.pydata.org/docs/user_guide/indexing.html

##Task 9. Sort the table by Fare in descending order (1 pt)

In [13]:
# by creating new DataFrame
sorted_df = df.sort_values(by='Fare', ascending=False)

sorted_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

In [14]:
# in-place sorting 
df.sort_values(by='Fare', ascending=False, inplace=True)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

##Task 10 Implement simple model to predict whether the person have survived according to knowledge you got from data analysis. Then calculate accuracy of your predictions on the dataset. Try to maximize accuracy (a student with maximum accuracy will recieve additional points). For example, the simplest model may look like (df["predict_survived"] = df["Sex"] == "male") (3 pt)

In tackling prediction tasks, establishing a baseline model is crucial for assessing the performance of more complex models. While higher accuracy is generally desirable, you should avoid achieving it through overfitting. For this task, a sensible baseline could be predicting that all women survive and all men perish. Any solution surpassing this baseline accuracy is valid only if it reflects genuine predictive power and not data fitting.

In [15]:
from sklearn.metrics import accuracy_score

# Create a baseline prediction where all women survive and all men perish
baseline_predictions = df['Sex'].map({'female': 1, 'male': 0})

# Calculate accuracy of the baseline model
baseline_accuracy = accuracy_score(df['Survived'], baseline_predictions)

print(f"Baseline Accuracy: {baseline_accuracy:.2%}")

Baseline Accuracy: 78.68%